# specify a directory to install
cask_args appdir: '/Applications'

# install packages
brew 'git'
brew 'gh'
brew 'gpg'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'tree'
# Cross-language version manager:
brew 'asdf'
# Cross-language formatter:
brew 'dprint'
# Nvim-related:
brew 'neovim', args: ["HEAD"]
brew 'tree-sitter', args: ["HEAD"]
brew 'code-minimap'
# Grep replacement:
brew 'ripgrep'
brew 'bat'
# Casks
cask 'spotify'
cask 'amethyst'
