# specify a directory to install
cask_args appdir: '/Applications'

brew 'asdf' # Cross-language version manager
brew 'bash-completion'
brew 'bat' # `cat` upgrade
brew 'code-minimap' # Nice minimap implementation, can be used in text editor
brew 'coreutils'
brew 'curl'
brew 'dprint' # General-purpose formatter
brew 'exercism' # Cross-lanauge katas
brew 'fd' # `find` upgrade
brew 'gcc'
brew 'gh'
# brew 'git'
brew 'gpg'
brew 'jq'
brew 'just'
brew 'lazygit' # Git TUI
brew 'luajit', args: ['HEAD'] # Nvim-related. REVIEW: install via ASDF?
brew 'neovim', args: ['HEAD'] # Nvim-related. REVIEW: install via ASDF?
brew 'ossp-uuid'
brew 'ripgrep' # `grep` upgrade
brew 'starship' # Command prompt. REVIEW: install via ASDF?
brew 'stylua' # Lue formatter
brew 'tcl-tk' # NOTE: language not available via ASDF
brew 'tree'
brew 'tree-sitter', args: ['HEAD'] # Nvim-related. REVIEW: install via ASDF?
brew 'wget'
brew 'zlib'

cask 'alfred'
cask 'amethyst'
cask 'kitty'
cask 'dropbox'
