# specify a directory to install
cask_args appdir: '/Applications'

# Generally useful packages
# brew 'git'
brew 'gh'
brew 'gpg'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'tree'
brew 'just'
brew 'wget'
# Cross-language version manager:
brew 'asdf'
# Command prompt
brew 'starship'
# Languages not managed by ASDF
brew 'tcl-tk'
# Formatters:
brew 'dprint'
brew 'stylua'
# Nvim-related:
brew 'luajit', args: ['HEAD']
brew 'neovim', args: ['HEAD']
brew 'tree-sitter', args: ['HEAD']
brew 'code-minimap'
# `find` upgrade
brew 'fd'
# `grep` upgrade:
brew 'ripgrep'
# Cat upgrade:
brew 'bat'
# Casks
# cask 'spotify'
cask 'alfred'
cask 'amethyst'
cask 'kitty'
cask 'dropbox'
